# GetCurve Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundaryConditions..::..GetCurve Method
BoundaryConditions Class See Also
---
Returns curve that define geometry of the line boundary conditions.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Curve GetCurve()
```

Visual Basic
---
```text
Public Function GetCurve As Curve
```

Visual C++
---
```text
public:
Curve^ GetCurve()
```

# Remarks
Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Line type. |

# See Also
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace